Revit 2027 API
ProjectPosition(ProjectPosition) Constructor
 Creates a copy of the ProjectPosition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ProjectPosition(
	ProjectPosition other
)
Public Sub New (
	other As ProjectPosition
)
public:
ProjectPosition(
	ProjectPosition^ other
)
new :
        other : ProjectPosition -> ProjectPosition
Parameters
other ProjectPosition
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ProjectPosition Class
ProjectPosition Overload
Autodesk.Revit.DB Namespace